emacs.org
#+SETUPFILE: ./_setup.org
#+TITLE: Vincent Demeester's .emacs.d

* Overview
:PROPERTIES:
:CUSTOM_ID: h:958fee2e-86db-4d34-bef6-d5b4f4f73000
:END:
** Canonical links to this document
:PROPERTIES:
:CUSTOM_ID: h:11f5b93f-6dd7-483c-aa44-e10471f17c22
:END:

+ HTML version :: [[https://sbr.pm/dotemacs][sbr.pm/dotemacs]]
+ Git repo :: [[https://github.com/vdemeester/emacs-config.git][github.com/vdemeester/emacs-config]]

** What is this
:PROPERTIES:
:CUSTOM_ID: h:e9d0ae1c-244c-4ad9-b0dc-c5e53b8d49ea
:END:

The present document, referred to in the source code version as =emacs.org=, contains the
bulk of my configurations for GNU Emacs. It is designed using principles of "literate
programming": a combination of ordinary language and inline code blocks. Emacs knows how
to parse this file properly so as to evaluate only the elisp ("Emacs Lisp") included
herein. The rest is for humans to make sense of my additions and their underlying
rationale.

#+BEGIN_QUOTE
Literate programming allows us to be more expressive and deliberate. Not only we can use
typography to its maximum potential, but can also employ techniques such as internal links
between sections. This makes the end product much better for end users, than a terse
script.
#+END_QUOTE

I switched back and forth on using =org-mode= and literate programming, so why re-using
it. First, I think I went for it the wrong way the first time. I copied part of the
configuration from elsewhere, sometimes without really needing what I was copying. for
some reason I think this is a common pattern when configuring Emacs. You start by using a
distribution (Doom Emacs, Spacemacs, …) or by copying configuration from all over the
place. Slowly but surely you realize this was a mistake as you didn't learn anything, so
you *reboot* your configuration.

I'm taking [[https://protesilaos.com/][Protesilaos Stavrou]] approach on writing and configuring this file (see [[https://protesilaos.com/dotemacs/][his
dotemacs]]), although I am not loading it directly. I prefer using the [[https://orgmode.org/manual/tangle.html][tangle]] feature of
=org-mode= instead of loading it using ~org-babel~ function. This allows me to document my
configuration and generating final(s) ~.el~ files. Those files can then load and/or
pre-compile, without the need to load =org= first. It also means that I can add code
pieces in there that won't be /tangle/, like usage example ; and I also can use this to
generate any additional file I need, whatever the programming language they are written
in.
** COPYING
:PROPERTIES:
:CUSTOM_ID: h:13ded0f2-230e-406f-85e1-979aca3b4cd6
:END:

Copyright (c) 2013-2020 Vincent Demeester <vincent@sbr.pm>

This file is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by the
Free Software Foundation, either version 3 of the License, or (at
your option) any later version.

This file is distributed in the hope that it will be useful, but
WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
General Public License for more details.

You should have received a copy of the GNU General Public License
along with this file.  If not, see <http://www.gnu.org/licenses/>.

* TODO Base settings
:PROPERTIES:
:CUSTOM_ID: h:b5ee7306-620f-4ab8-9da5-a6c8781a93b5
:END:

This section contains configurations that are needed prior to the setup of everything
else. Anything that needs to be configured first should be in there, this includes the
~init.el~ and ~early-init.el~ files content.

Starting with Emacs 27, an =early-init.el= file can be used to do early configuration
and optimization.

#+begin_quote
Emacs can now be configured using an early init file. The file is called ~early-init.el~,
in ~user-emacs-directory~. It is loaded very early in the startup process: before
graphical elements such as the tool bar are initialized, and before the package manager is
initialized. The primary purpose is to allow customizing how the package system is
initialized given that initialization now happens before loading the regular init file
(see below).

We recommend against putting any customizations in this file that don't need to be set up
before initializing installed add-on packages, because the early init file is read too
early into the startup process, and some important parts of the Emacs session, such as
'window-system' and other GUI features, are not yet set up, which could make some
customization fail to work.
#+end_quote

We can use this to our advantage and optimize the initial loading of emacs.

- Before Emacs 27, the init file was responsible for initializing the package manager by
  calling `package-initialize'.  Emacs 27 changed the default behavior: It now calls
  `package-initialize' before loading the init file.

  #+begin_src emacs-lisp :tangle early-init.el
    (setq package-enable-at-startup nil)
  #+end_src

- Let's inhibit resizing the frame at early stage.

  #+begin_src emacs-lisp :tangle early-init.el
    (setq frame-inhibit-implied-resize t)
  #+end_src

- I never use the /menu-bar/, or the /tool-bar/ or even the /scroll-bar/, so we can safely
  disable those very very early.

  #+begin_src emacs-lisp :tangle early-init.el
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (horizontal-scroll-bar-mode -1)
  #+end_src

- Finally we can try to avoid garbage collection at startup. The garbage collector can
  easily double startup time, so we suppress it at startup by turning up ~gc-cons-threshold~
  (and perhaps ~gc-cons-percentage~) temporarily.

  #+begin_src emacs-lisp :tangle early-init.el
    (setq gc-cons-threshold 402653184
          gc-cons-percentage 0.6)
  #+end_src

  However, it is important to reset it eventually. Not doing so will cause garbage
  collection freezes during long-term interactive use. Conversely, a ~gc-cons-threshold~
  that is too small will cause stuttering.

  #+begin_src emacs-lisp :tangle early-init.el
    (add-hook 'after-init-hook
              `(lambda ()
                 (setq gc-cons-threshold 16777216 ; 16mb
                       gc-cons-percentage 0.1)
                 (garbage-collect)) t)
  #+end_src

One thing though, I am currently not necessarily running Emacs 27, so I am going to need
to have the same configuration in ~init.el~ for a little bit of time.

#+begin_src emacs-lisp :tangle init.el
  ;;; -*- lexical-binding: t; -*-
  (defconst emacs-start-time (current-time))

  (when (< emacs-major-version 27)
    (setq package-enable-at-startup nil)

    (setq frame-inhibit-implied-resize)

    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (horizontal-scroll-bar-mode -1)

    (setq gc-cons-threshold 402653184
          gc-cons-percentage 0.6)

    (add-hook 'after-init-hook
              `(lambda ()
                 (setq gc-cons-threshold 16777216 ; 16mb
                       gc-cons-percentage 0.1)
                 (garbage-collect)) t))
#+end_src


* TODO Selection candidates and search methods
:PROPERTIES:
:CUSTOM_ID: h:571cf8bc-a359-4d75-9d56-b35c22126cf2
:END:

* TODO Directory, buffer and window management
:PROPERTIES:
:CUSTOM_ID: h:d93bf4bc-62c9-4873-a80e-4ddd874d64c4
:END:

* TODO Applications and utilities
:PROPERTIES:
:CUSTOM_ID: h:9bb3e4bd-c13a-4311-8af7-588fb0386a03
:END:

* TODO Programming
:PROPERTIES:
:CUSTOM_ID: h:a6c9891a-6195-4987-b98f-fd06e1147b47
:END:
* Legacy
:PROPERTIES:
:CUSTOM_ID: h:66d47486-8c74-4028-a9c7-8cfe75c07e1a
:END:

This holds legacy code from the previous configuration (without org-mode). This will
slowly but surely move into an org-mode header and or disappear.

** Configurations
:PROPERTIES:
:CUSTOM_ID: h:2080e917-9414-4a08-8fb8-f3cdbedf8642
:END:

These are the initial configuration files to be imported in this file slowly but surely.

