emacs.org
*** ~setup-files.el~
:PROPERTIES:
:CUSTOM_ID: h:f7b54e8c-f10e-4fd8-9c54-bc3c31b36915
:END:

#+begin_src emacs-lisp :tangle lisp/setup-files.el
  ;;; -*- lexical-binding: t; -*-
  (use-package files                      ; Core commands for files
    :bind (("<f5>" . revert-buffer)))

  (use-package ripgrep
    :defer 2)

  (use-package recentf
    :custom
    (recentf-max-menu-items 15)
    (recentf-max-saved-items 200)
    (recentf-show-file-shortcuts-flag nil)
    :config
    (recentf-mode 1)
    (add-to-list 'recentf-exclude "^/\\(?:ssh\\|su\\|sudo\\)?:")
    ;; Magic advice to rename entries in recentf when moving files in
    ;; dired.
    (defun rjs/recentf-rename-notify (oldname newname &rest args)
      (if (file-directory-p newname)
          (rjs/recentf-rename-directory oldname newname)
        (rjs/recentf-rename-file oldname newname)))

    (defun rjs/recentf-rename-file (oldname newname)
      (setq recentf-list
            (mapcar (lambda (name)
                      (if (string-equal name oldname)
                          newname
                        oldname))
                    recentf-list))
      recentf-cleanup)

    (defun rjs/recentf-rename-directory (oldname newname)
      ;; oldname, newname and all entries of recentf-list should already
      ;; be absolute and normalised so I think this can just test whether
      ;; oldname is a prefix of the element.
      (setq recentf-list
            (mapcar (lambda (name)
                      (if (string-prefix-p oldname name)
                          (concat newname (substring name (length oldname)))
                        name))
                    recentf-list))
      recentf-cleanup)

    (advice-add 'dired-rename-file :after #'rjs/recentf-rename-notify)

    (defun contrib/recentf-add-dired-directory ()
      "Include Dired buffers in the list.  Particularly useful when
  combined with a completion framework's ability to display virtual
  buffers."
      (when (and (stringp dired-directory)
                 (equal "" (file-name-nondirectory dired-directory)))
        (recentf-add-file dired-directory))))

  (setq view-read-only t)                 ; View read-only

  (use-package direnv
    :custom
    (direnv-always-show-summary t)
    (direnv-show-paths-in-summary nil)
    :config
    (direnv-mode))

  (use-package hardhat                    ; Protect user-writable files
    :init (global-hardhat-mode))

  (use-package image-file                 ; Visit images as images
    :init (auto-image-file-mode))

  (use-package markdown-mode              ; Edit markdown files
    :mode ("\\.md\\'" . markdown-mode)
    :config
    (setq markdown-fontify-code-blocks-natively t)

    ;; Don't change font in code blocks
    (set-face-attribute 'markdown-code-face nil
                        :inherit nil)

    ;; Process Markdown with Pandoc, using a custom stylesheet for nice output
    (let ((stylesheet (expand-file-name
                       (locate-user-emacs-file "etc/pandoc.css"))))
      (setq markdown-command
            (mapconcat #'shell-quote-argument
                       `("pandoc" "--toc" "--section-divs"
                         "--css" ,(concat "file://" stylesheet)
                         "--standalone" "-f" "markdown" "-t" "html5")
                       " ")))
    (add-hook 'markdown-mode-hook #'auto-fill-mode))

  (use-package highlight-indentation
    :config
    (set-face-background 'highlight-indentation-face "#e3e3d3")
    (set-face-background 'highlight-indentation-current-column-face "#c3b3b3"))

  (use-package yaml-mode
    :mode "\\.ya?ml\\'"
    :hook ((yaml-mode . highlight-indentation-mode)
           (yaml-mode . highlight-indentation-current-column-mode)))

  (use-package toml-mode
    :mode "\\.to?ml\\'")

  ;;;###autoload
  (defun vde/delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (or (buffer-file-name) (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name))
      (kill-this-buffer)))

  ;;;###autoload
  (defun vde/rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "sNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (when (file-exists-p filename)
            (rename-file filename new-name 1))
          (rename-buffer new-name)
          (set-visited-file-name new-name)))))

  (bind-key "C-c f D" #'vde/delete-this-file)
  (bind-key "C-c f R" #'vde/rename-this-file-and-buffer)

  ;; Additional bindings for built-ins
  (bind-key "C-c f v d" #'add-dir-local-variable)
  (bind-key "C-c f v l" #'add-file-local-variable)
  (bind-key "C-c f v p" #'add-file-local-variable-prop-line)

  (defun vde/reload-dir-locals-for-current-buffer ()
    "Reload dir locals for the current buffer."
    (interactive)
    (let ((enable-local-variables :all))
      (hack-dir-local-variables-non-file-buffer)))

  (defun vde/reload-dir-locals-for-all-buffers-in-this-directory ()
    "Reload dir-locals for all buffers in current buffer's `default-directory'."
    (interactive)
    (let ((dir default-directory))
      (dolist (buffer (buffer-list))
        (with-current-buffer buffer
          (when (equal default-directory dir))
          (vde/reload-dir-locals-for-current-buffer)))))

  (bind-key "C-c f v r" #'vde/reload-dir-locals-for-current-buffer)
  (bind-key "C-c f v r" #'vde/reload-dir-locals-for-all-buffers-in-this-directory)

  (provide 'setup-files)
#+end_src

*** ~setup-gnus.el~
:PROPERTIES:
:CUSTOM_ID: h:6325713e-e541-43a7-adb7-e98b5478593c
:END:

#+begin_src emacs-lisp :tangle lisp/setup-gnus.el
  ;;; -*- lexical-binding: t; -*-
  (setq user-mail-address "vincent@demeester.fr"
        user-full-name "Vincent Demeester")

  (setq gnus-select-method
        '(nnimap "vincent@demeester.fr"
                 (nnimap-address "mail.gandi.net")  ; it could also be imap.googlemail.com if that's your server.
                 (nnimap-server-port "imaps")
                 (nnimap-stream ssl)))

  (setq smtpmail-smtp-server "mail.gandi.net"
        smtpmail-smtp-service 587
        gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]")

  ;; (require 'nnrss)
  ;; (nnrss-opml-import "~/desktop/downloads/feedly.opml")

  (provide setup-gnus)
#+end_src

*** ~setup-go.el~
:PROPERTIES:
:CUSTOM_ID: h:64e5b918-3d56-40ba-a07f-e56294f1575a
:END:

#+begin_src emacs-lisp :tangle lisp/setup-go.el
  ;;; -*- lexical-binding: t; -*-
  (use-package go-mode
    :mode "\\.go$"
    :interpreter "go"
    :config
    (use-package company-go
      :config
      (setq company-go-show-annotation t)
      (push 'company-go company-backends))
    (setq gofmt-command "goimports")
    (if (not (executable-find "goimports"))
        (warn "go-mode: couldn't find goimports; no code formatting/fixed imports on save")
      (add-hook 'before-save-hook 'gofmt-before-save))
    (if (not (string-match "go" compile-command))   ; set compile command default
        (set (make-local-variable 'compile-command)
             "go build -v && go test -v && go vet")))

  (use-package flycheck-golangci-lint
    :hook (go-mode . flycheck-golangci-lint-setup)
    :config (setq flycheck-golangci-lint-tests t))

  (use-package dap-go
    :after dap-mode)

  (use-package gotest-ui
    :after go-mode
    :bind (:map go-mode-map
                ("C-c t t" . gotest-ui-current-test)
                ("C-c t f" . gotest-ui-current-file)
                ("C-c t p" . gotest-ui-current-project)))

  (provide 'setup-go)
#+end_src

*** ~setup-hydras.el~
:PROPERTIES:
:CUSTOM_ID: h:81612e01-a0c8-42c2-a1fe-34bd1b9d8002
:END:

#+begin_src emacs-lisp :tangle lisp/setup-hydras.el
  ;;; -*- lexical-binding: t; -*-
  (defhydra hydra-goto-line (goto-map "")
    "goto-line"
    ("g" goto-line "go")
    ("m" set-mark-command "mark" :bind nil)
    ("q" nil "quit"))

  (defhydra hydra-yank-pop ()
    "yank"
    ("C-y" yank nil)
    ("M-y" yank-pop nil)
    ("y" (yank-pop 1) "next")
    ("Y" (yank-pop -1) "prev"))   ; or browse-kill-ring

  (defhydra hydra-zoom (global-map "<f2>")
    "zoom"
    ("g" text-scale-increase "in")
    ("l" text-scale-decrease "out")
    ("r" (text-scale-set 0) "reset")
    ("0" (text-scale-set 0) :bind nil :exit t)
    ("1" (text-scale-set 0) nil :bind nil :exit t))

  ;; Better shrink/enlarge windows
  (defhydra hydra-resize (global-map "<f2>")
    "resize windows"
    ("<up>" enlarge-window "enlarge")
    ("<down>" shrink-window "shrink")
    ("<left>" shrink-window-horizontally "shrink horizontaly")
    ("<right>" enlarge-window-horizontally "enlarge horizontaly"))

  (defvar hide-mode-line-mode nil)
  (defvar whitespace-mode nil)
  (defvar subword-mode nil)
  (defhydra hydra-toggle (:color pink :hint nil)
    "
  _a_ abbrev-mode:          %`abbrev-mode
  _b_ subword-mode:         %`subword-mode
  _d_ debug-on-error:       %`debug-on-error
  _h_ hide-mode-line-mode   %`hide-mode-line-mode
  _f_ auto-fill-mode:       %`auto-fill-function
  _r_ readonly-mode:        %`buffer-read-only
  _t_ truncate-lines        %`truncate-lines
  _v_ visual-line-mode:     %`visual-line-mode
  _w_ whitespace-mode:      %`whitespace-mode
  _s_ smartparens-strict:   %`smartparens-strict-mode
  _V_ visible-mode:         %`visible-mode
  "
    ("a" abbrev-mode             nil)
    ("b" subword-mode            nil)
    ("d" toggle-debug-on-error   nil)
    ("f" auto-fill-mode          nil)
    ("h" hide-mode-line-mode     nil)
    ("r" dired-toggle-read-only  nil)
    ("t" toggle-truncate-lines   nil)
    ("v" visual-line-mode        nil)
    ("V" visible-mode            nil)
    ("w" whitespace-mode         nil)
    ("s" smartparens-strict-mode nil)
    ("q" nil "quit"))

  (global-set-key (kbd "C-c C-v") 'hydra-toggle/body)

  (defhydra hydra-marked-items (dired-mode-map "")
    "
  Number of marked items: %(length (dired-get-marked-files))
  "
    ("m" dired-mark "mark"))

  (bind-key "M-y" #'hydra-yank-pop/yank-pop)
  (bind-key "C-y" #'hydra-yank-pop/yank)

  (provide 'setup-hydras)
#+end_src

*** ~setup-keybindings.el~
:PROPERTIES:
:CUSTOM_ID: h:9b69d5a9-f589-4348-9798-7a03c850fcbc
:END:

#+begin_src emacs-lisp :tangle lisp/setup-keybindings.el
  (use-package which-key
    :init (which-key-mode)
    :custom
    (which-key-idle-delay 2)
    (which-key-idle-secondary-delay 0.05)
    (which-key-show-early-on-C-h t)
    (which-key-sort-order 'which-key-prefix-then-key-order)
    (which-key-popup-type 'side-window)
    (which-key-show-prefix 'echo)
    (which-key-max-display-columns 6)
    (which-key-separator " → ")
    :config
    (add-to-list 'which-key-replacement-alist '(("TAB" . nil) . ("↹" . nil)))
    (add-to-list 'which-key-replacement-alist '(("RET" . nil) . ("⏎" . nil)))
    (add-to-list 'which-key-replacement-alist '(("DEL" . nil) . ("⇤" . nil)))
    (add-to-list 'which-key-replacement-alist '(("SPC" . nil) . ("␣" . nil))))

  (use-package region-bindings-mode
    :config
    ;; Do not activate `region-bindings-mode' in Special modes like `dired' and
    ;; `ibuffer'. Single-key bindings like 'm' are useful in those modes even
    ;; when a region is selected.
    (setq region-bindings-mode-disabled-modes '(dired-mode ibuffer-mode))

    (region-bindings-mode-enable)

    (defun vde/disable-rbm-deactivate-mark ()
      "Disable `region-bindings-mode' and deactivate mark."
      (interactive)
      (region-bindings-mode -1)
      (deactivate-mark)
      (message "Mark deactivated"))

    (bind-keys
     :map region-bindings-mode-map
     ("<C-SPC>" . vde/disable-rbm-deactivate-mark)))

  ;; Disable C-x C-n to avoid the disabled command buffer
  (unbind-key "C-x C-n" global-map)

  (provide 'setup-keybindings)
#+end_src

