emacs.org
*** ~setup-multiple-cursor.el~
:PROPERTIES:
:CUSTOM_ID: h:462c3e34-87b1-4c1a-b388-e698c057f15e
:END:

#+begin_src emacs-lisp :tangle lisp/setup-multiple-cursors.el
  (use-package multiple-cursor
    :bind (:map vde-mode-map
                ("C-S-c C-S-c" . mc/edit-lines))
    :bind (:map region-bindings-mode-map
                ("a" . mc/mark-all-like-this)
                ("p" . mc/mark-previous-like-this)
                ("n" . mc/mark-next-like-this)
                ("P" . mc/unmark-previous-like-this)
                ("N" . mc/unmark-next-like-this)
                ("[" . mc/cycle-backward)
                ("]" . mc/cycle-forward)
                ("m" . mc/mark-more-like-this-extended)
                ("h" . mc-hide-unmatched-lines-mode)
                ("\\" . mc/vertical-align-with-space)
                ("#" . mc/insert-numbers) ; use num prefix to set the starting number
                ("^" . mc/edit-beginnings-of-lines)
                ("$" . mc/edit-ends-of-lines)))

  (provide 'setup-multiple-cursors)
#+end_src

*** ~setup-navigating.el~
:PROPERTIES:
:CUSTOM_ID: h:c5ec18c7-1153-451c-b472-33b55f1bba77
:END:

#+begin_src emacs-lisp :tangle lisp/setup-navigating.el
  (use-package avy                   ; Jump to characters in buffers
    :bind (("C-c j"   . avy-goto-word-1)
           ("C-c n b" . avy-pop-mark)
           ("C-c n j" . avy-goto-char-2)
           ("C-c n t" . avy-goto-char-timer)
           ("C-c n w" . avy-goto-word-1)))

  (use-package helpful
    :bind (("C-c h F" . helpful-function)
           ("C-c h C" . helpful-command)
           ("C-c h M" . helpful-macro)
           ("C-c h L" . helpful-callable)
           ("C-c h S" . helpful-at-point)
           ("C-c h V" . helpful-variable)))
  (use-package winner
    :unless noninteractive
    :defer 5
    :config
    (winner-mode 1))

  (use-package hideshow
    :defer 5
    :bind (("C-c @ a" . hs-show-all)
           ("C-c @ c" . hs-toggle-hiding)
           ("C-c @ t" . hs-hide-all)
           ("C-c @ d" . hs-hide-block)
           ("C-c @ l" . hs-hide-level)))

  (use-package mwim
    :bind (:map prog-mode-map
                ("C-a" . mwim-beginning-of-code-or-line)
                ("C-e" . mwim-end-of-code-or-line)))

  (provide 'setup-navigating)
#+end_src

*** ~setup-nix.el~
:PROPERTIES:
:CUSTOM_ID: h:f82d7d6f-55bf-495d-b71f-dd4719ece06e
:END:

#+begin_src emacs-lisp :tangle lisp/setup-nix.el
  ;;; -*- lexical-binding: t; -*-
  (use-package nix-mode
    :mode ("\\.nix\\'" "\\.nix.in\\'"))

  (use-package nix-drv-mode
    :ensure nix-mode
    :mode "\\.drv\\'")

  (use-package nix-shell
    :ensure nix-mode
    :commands (nix-shell-unpack nix-shell-configure nix-shell-build))

  (provide 'setup-nix)
#+end_src

*** ~setup-notmuch.el~
:PROPERTIES:
:CUSTOM_ID: h:3505ad73-785d-4849-98a6-9081c6d8e93d
:END:

#+begin_src emacs-lisp :tangle lisp/setup-notmuch.el
  (use-package notmuch
    :defer t
    :bind ("<f6>" . notmuch)
    :config
    (setq notmuch-search-oldest-first nil
          mail-user-agent 'message-user-agent
          notmuch-tree-show-out t)
    (setq notmuch-saved-searches
          '((:key "i" :name "inbox" :query "tag:Inbox")
            (:key "r" :name "redhat inbox folder" :query "folder:redhat/Inbox")
            (:key "p" :name "perso inbox folder" :query "folder:perso/Inbox")
            (:key "u" :name "unread" :query "tag:unread")
            (:key "F" :name "flagged" :query "tag:flagged")
            (:key "S" :name "sent" :query "tag:Sent Mail"))))

  (use-package sendmail
    :defer t
    :commands (mail-mode mail-text)
    :defines (send-mail-function)
    :config
    (setq send-mail-function 'sendmail-send-it
          sendmail-program "/home/vincent/bin/msmtp"))

  (use-package message
    :commands (message-mode message-cite-original-without-signature)
    :config
    (add-hook 'message-mode-hook 'turn-on-auto-fill)
    (setq  message-default-mail-headers "Cc: \nBcc: \n"
           message-kill-buffer-on-exit t
           message-generate-headers-first t))

  (provide 'setup-notmuch)
#+end_src

